; domain
(define (domain child-snack)
  (:requirements :equality :typing)
  (:types object
	object - object
	child - object
	bread-portion - object
	content-portion - object
	sandwich - object
	tray - object
	place - object)
  (:constants kitchen - place)
  (:predicates (at_kitchen_bread ?b - bread-portion)
	(at_kitchen_content ?c - content-portion)
	(at_kitchen_sandwich ?s - sandwich)
	(no_gluten_bread ?b - bread-portion)
	(no_gluten_content ?c - content-portion)
	(ontray ?s - sandwich ?t - tray)
	(no_gluten_sandwich ?s - sandwich)
	(allergic_gluten ?c - child)
	(not_allergic_gluten ?c - child)
	(served ?c - child)
	(waiting ?c - child ?p - place)
	(at ?t - tray ?p - place)
	(notexist ?s - sandwich)
	(= ?x - object ?y - object)
	(= ?x - object ?y - object))
  (:functions )
  (:action make_sandwich_no_gluten
	:parameters (?s - sandwich
		?b - bread-portion
		?c - content-portion)
	:precondition (and
		(at_kitchen_bread ?b)
		(at_kitchen_content ?c)
		(no_gluten_bread ?b)
		(no_gluten_content ?c)
		(notexist ?s))
	:effect (and
		(not (at_kitchen_bread ?b))
		(not (at_kitchen_content ?c))
		(at_kitchen_sandwich ?s)
		(no_gluten_sandwich ?s)
		(not (notexist ?s))))

  (:action make_sandwich
	:parameters (?s - sandwich
		?b - bread-portion
		?c - content-portion)
	:precondition (and
		(at_kitchen_bread ?b)
		(at_kitchen_content ?c)
		(notexist ?s))
	:effect (and
		(not (at_kitchen_bread ?b))
		(not (at_kitchen_content ?c))
		(not (notexist ?s))
		(at_kitchen_sandwich ?s)))

  (:action put_on_tray
	:parameters (?s - sandwich
		?t - tray)
	:precondition (and
		(at_kitchen_sandwich ?s)
		(at ?t kitchen))
	:effect (and
		(not (at_kitchen_sandwich ?s))
		(ontray ?s ?t)))

  (:action serve_sandwich_no_gluten
	:parameters (?s - sandwich
		?c - child
		?t - tray
		?p - place)
	:precondition (and
		(allergic_gluten ?c)
		(ontray ?s ?t)
		(waiting ?c ?p)
		(no_gluten_sandwich ?s)
		(at ?t ?p))
	:effect (and
		(not (ontray ?s ?t))
		(served ?c)))

  (:action serve_sandwich
	:parameters (?s - sandwich
		?c - child
		?t - tray
		?p - place)
	:precondition (and
		(not_allergic_gluten ?c)
		(waiting ?c ?p)
		(ontray ?s ?t)
		(at ?t ?p))
	:effect (and
		(not (ontray ?s ?t))
		(served ?c)))

  (:action move_tray
	:parameters (?t - tray
		?p1 - place
		?p2 - place)
	:precondition (at ?t ?p1)
	:effect (and
		(not (at ?t ?p1))
		(at ?t ?p2))))

; problem
; child-snack task with 6 children and 0.4 gluten factor 
; constant factor of 1.0
; random seed: 138

(define (problem prob-snack)
  (:domain child-snack)
  (:objects
    child1 child2 child3 child4 child5 child6 - child
    bread1 bread2 bread3 bread4 bread5 bread6 - bread-portion
    content1 content2 content3 content4 content5 content6 - content-portion
    tray1 tray2 tray3 tray4 - tray
    table1 table2 table3 - place
    sandw1 sandw2 sandw3 sandw4 sandw5 sandw6 - sandwich
  )
  (:init
     (at tray1 kitchen)
     (at tray2 kitchen)
     (at tray3 kitchen)
     (at tray4 kitchen)
     (at_kitchen_bread bread1)
     (at_kitchen_bread bread2)
     (at_kitchen_bread bread3)
     (at_kitchen_bread bread4)
     (at_kitchen_bread bread5)
     (at_kitchen_bread bread6)
     (at_kitchen_content content1)
     (at_kitchen_content content2)
     (at_kitchen_content content3)
     (at_kitchen_content content4)
     (at_kitchen_content content5)
     (at_kitchen_content content6)
     (no_gluten_bread bread2)
     (no_gluten_bread bread4)
     (no_gluten_content content4)
     (no_gluten_content content3)
     (allergic_gluten child5)
     (allergic_gluten child2)
     (not_allergic_gluten child3)
     (not_allergic_gluten child1)
     (not_allergic_gluten child4)
     (not_allergic_gluten child6)
     (waiting child1 table2)
     (waiting child2 table1)
     (waiting child3 table1)
     (waiting child4 table1)
     (waiting child5 table2)
     (waiting child6 table1)
     (notexist sandw1)
     (notexist sandw2)
     (notexist sandw3)
     (notexist sandw4)
     (notexist sandw5)
     (notexist sandw6)
  )
  (:goal
    (and
     (served child1)
     (served child2)
     (served child3)
     (served child4)
     (served child5)
     (served child6)
    )
  )
)

; plan
1. (make_sandwich_no_gluten sandw6 bread4 content4)
   deleted: (at_kitchen_bread bread4) (at_kitchen_content content4) (notexist sandw6)
   added: (at_kitchen_sandwich sandw6) (no_gluten_sandwich sandw6)
   goals met: 0 of 6
2. (put_on_tray sandw6 tray2)
   deleted: (at_kitchen_sandwich sandw6)
   added: (ontray sandw6 tray2)
   goals met: 0 of 6
3. (make_sandwich sandw5 bread6 content6)
   deleted: (at_kitchen_bread bread6) (at_kitchen_content content6) (notexist sandw5)
   added: (at_kitchen_sandwich sandw5)
   goals met: 0 of 6
4. (put_on_tray sandw5 tray2)
   deleted: (at_kitchen_sandwich sandw5)
   added: (ontray sandw5 tray2)
   goals met: 0 of 6
5. (make_sandwich sandw4 bread5 content5)
   deleted: (at_kitchen_bread bread5) (at_kitchen_content content5) (notexist sandw4)
   added: (at_kitchen_sandwich sandw4)
   goals met: 0 of 6
6. (put_on_tray sandw4 tray2)
   deleted: (at_kitchen_sandwich sandw4)
   added: (ontray sandw4 tray2)
   goals met: 0 of 6
7. (make_sandwich sandw3 bread3 content2)
   deleted: (at_kitchen_bread bread3) (at_kitchen_content content2) (notexist sandw3)
   added: (at_kitchen_sandwich sandw3)
   goals met: 0 of 6
8. (put_on_tray sandw3 tray2)
   deleted: (at_kitchen_sandwich sandw3)
   added: (ontray sandw3 tray2)
   goals met: 0 of 6
9. (move_tray tray2 kitchen table1)
   deleted: (at tray2 kitchen)
   added: (at tray2 table1)
   goals met: 0 of 6
10. (serve_sandwich_no_gluten sandw6 child2 tray2 table1)
   deleted: (ontray sandw6 tray2)
   added: (served child2)
   goals met: 1 of 6
11. (serve_sandwich sandw5 child6 tray2 table1)
   deleted: (ontray sandw5 tray2)
   added: (served child6)
   goals met: 2 of 6
12. (serve_sandwich sandw4 child4 tray2 table1)
   deleted: (ontray sandw4 tray2)
   added: (served child4)
   goals met: 3 of 6
13. (serve_sandwich sandw3 child3 tray2 table1)
   deleted: (ontray sandw3 tray2)
   added: (served child3)
   goals met: 4 of 6
14. (make_sandwich_no_gluten sandw2 bread2 content3)
   deleted: (at_kitchen_bread bread2) (at_kitchen_content content3) (notexist sandw2)
   added: (at_kitchen_sandwich sandw2) (no_gluten_sandwich sandw2)
   goals met: 4 of 6
15. (put_on_tray sandw2 tray1)
   deleted: (at_kitchen_sandwich sandw2)
   added: (ontray sandw2 tray1)
   goals met: 4 of 6
16. (make_sandwich sandw1 bread1 content1)
   deleted: (at_kitchen_bread bread1) (at_kitchen_content content1) (notexist sandw1)
   added: (at_kitchen_sandwich sandw1)
   goals met: 4 of 6
17. (put_on_tray sandw1 tray1)
   deleted: (at_kitchen_sandwich sandw1)
   added: (ontray sandw1 tray1)
   goals met: 4 of 6
18. (move_tray tray1 kitchen table2)
   deleted: (at tray1 kitchen)
   added: (at tray1 table2)
   goals met: 4 of 6
19. (serve_sandwich sandw1 child1 tray1 table2)
   deleted: (ontray sandw1 tray1)
   added: (served child1)
   goals met: 5 of 6
20. (serve_sandwich_no_gluten sandw2 child5 tray1 table2)
   deleted: (ontray sandw2 tray1)
   added: (served child5)
   goals met: 6 of 6
